INSERT INTO country (country_name) VALUES ('Россия'), ('Швеция'), ('Норвегия'), ('Финляндия'), ('Канада');

INSERT INTO authors (name, country_id) VALUES
                                           ('Лев Николаевич Толстой', 1),
                                           ('Федор Михайлович Достоевский', 1),
                                           ('Астрид Лингрен', 2),
                                           ('Маргарет Этвуд', 5),
                                           ('Элис Маноро', 5),
                                           ('Мария Парр', 3);

INSERT INTO genres (genre_name) VALUES
                                    ('Роман'),
                                    ('Повесть'),
                                    ('Стихотворение'),
                                    ('Фэнтези'),
                                    ('Детектив');

INSERT INTO books (title,
                   author_id,
                   genre_id,
                   publication_year,
                   available_copies,
                   total_copies
                ) VALUES
                      ('Война и мир', 1, 1, 1852, 3, 5),
                      ('Анна Каренина', 1, 1, 1875, 1, 7),
                      ('Преступление и наказание', 2, 1, 1866, 4, 5),
                      ('Пеппи Длинный Чулок', 3, 2, 1945, 6, 6),
                      ('Съедобная женщина', 4, 1, 1969, 1, 1);

INSERT INTO readers (name, birth_date, email, registration_date) VALUES
                                                  ('Мария Переделкина', '1999-10-10', 'maria@gmail.com', '2010-10-10'),
                                                  ('Елена Златовласова', '2012-11-12', 'elena@gmail.com', '2015-10-10'),
                                                  ('Анастасия Курасова', '2000-01-05', 'nastya@gmail.com', '2020-10-10'),
                                                  ('Ирина Каруселькина', '2001-06-10', 'ira@gmail.com', '2022-10-10'),
                                                  ('Артем Носорогов', '2005-12-10', 'artem@gmail.com', '2023-10-10');

INSERT INTO loans (book_id, reader_id) VALUES (1, 1), (1, 2);

INSERT INTO loans (book_id, reader_id, loan_date, due_date, return_date) VALUES
                                                                             (2, 3, '2022-10-10', '2022-11-10', '2022-11-01'),
                                                                             (2, 4, '2025-01-10', '2025-02-10', '2025-02-12'),
                                                                             (3, 4, '2025-05-01', '2025-06-01', '2025-05-29'),
                                                                             (4, 2, '2020-09-10', '2020-10-10', '2020-11-01'),
                                                                             (4, 2, '2019-03-03', '2019-04-03', '2019-04-02');



